Revit 2026 API

# DGNExportOptions(DGNExportOptions) Constructor

---

Constructs a new instance of DGNExportOptions as a copy of the export options.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public DGNExportOptions(
	DGNExportOptions option
)
```
```vb
Public Sub New (
	option As DGNExportOptions
)
```
```cpp
public:
DGNExportOptions(
	DGNExportOptions^ option
)
```
```fsharp
new :
        option : DGNExportOptions -> DGNExportOptions
```

#### Parameters

option DGNExportOptions
     The options to be copied.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

DGNExportOptions Class

DGNExportOptions Overload

Autodesk.Revit.DB Namespace